assignment2/MyApp2/app/views/courses/show.html.erb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 1]]
---
    <ul>
    <% @course.lessons.each do |lesson| %>