assignment2/MyApp2/app/controllers/answers_controller.rb

    def create
      @answer = @question.answers.new(answer_params)
      @answer.user = current_user

      if @answer.save
---
INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "js"], ["user_id", 22], ["question_id", 3], ["created_at", "2024-11-17 20:21:04.454462"], ["updated_at", "2024-11-17 20:21:04.454462"]]

    def destroy
      @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 6]]

    def set_question
      @question = Question.find(params[:question_id])
      @course = Course.find(params[:course_id])
      @lesson = @course.lessons.find(params[:lesson_id])
      @question = @lesson.questions.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1 AND "lessons"."id" = $2 LIMIT $3  [["course_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."lesson_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["lesson_id", 2], ["id", 3], ["LIMIT", 1]]

    def set_answer
      @answer = @question.answers.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 AND "answers"."id" = $2 LIMIT $3  [["question_id", 10], ["id", 6], ["LIMIT", 1]]