assignment2/MyApp2/app/controllers/courses_controller.rb

  def show
    @course = Course.find params['id']
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    course = current_user.courses.new(course_params)
    if course.save
---
INSERT INTO "courses" ("title", "description", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Python"], ["description", "hola :)"], ["teacher_id", 8], ["created_at", "2024-11-05 15:04:47.824940"], ["updated_at", "2024-11-05 15:04:47.824940"]]

  def edit
    @course = Course.find params['id']
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    course = Course.find params['id']
    if course.update course_params
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "courses" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["title", "Demo"], ["description", "qwert"], ["updated_at", "2024-11-18 11:32:40.236519"], ["id", 43]]

  def destroy
    course = Course.find params['id']
    course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 4]]

  def set_course
    @course = Course.find params['id']
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]