assignment2/MyApp2/app/controllers/enrollments_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "enrollments" ("user_id", "course_id", "progress", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 8], ["course_id", 2], ["progress", nil], ["created_at", "2024-11-17 21:35:03.551775"], ["updated_at", "2024-11-17 21:35:03.551775"]]
---
  def create
    @course = Course.find(params[:course_id])
    @enrollment = Enrollment.new(user: current_user, course: @course)

    if @enrollment.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = $1 AND "enrollments"."course_id" = $2 LIMIT $3  [["user_id", 8], ["course_id", 2], ["LIMIT", 1]]
DELETE FROM "enrollments" WHERE "enrollments"."id" = $1  [["id", 23]]
---
  def destroy
    @course = Course.find(params[:course_id])
    @enrollment = Enrollment.find_by(user: current_user, course: @course)

    if @enrollment.destroy