assignment2/MyApp2/app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @lesson = Lesson.find params['id']

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def new
    @course = Course.find(params[:course_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
INSERT INTO "lessons" ("title", "content", "lesson_type", "course_id", "created_at", "updated_at", "video_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    course = Course.find(params[:course_id])
    lesson = course.lessons.build(lesson_params)
    if lesson.save

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def edit
    @lesson = Lesson.find params['id']

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "lessons" SET "updated_at" = $1, "video_url" = $2 WHERE "lessons"."id" = $3  [["updated_at", "2024-11-17 22:10:09.894973"], ["video_url", "https://www.youtube.com/watch?v=dQw4w9WgXcQ"], ["id", 20]]
---
  def update
    lesson = Lesson.find params['id']
    if lesson.update(lesson_params)

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", 13]]
---
  def destroy
    lesson = Lesson.find params['id']
    authorize! :destroy, @lesson
    lesson.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_course
    @course = Course.find(params[:course_id])