assignment2/MyApp2/app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "user_id", "lesson_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "tengo una duda\n"], ["user_id", 22], ["lesson_id", 4], ["created_at", "2024-11-17 01:17:43.883704"], ["updated_at", "2024-11-17 01:17:43.883704"]]
---
  def create
    @question = @lesson.questions.new(question_params)
    @question.user = current_user

    if @question.save

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_lesson
    @lesson = Lesson.find(params[:lesson_id])

SELECT "questions".* FROM "questions" WHERE "questions"."lesson_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["lesson_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def set_question
    @question = @lesson.questions.find(params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_course
    @course = Course.find(params[:course_id])