assignment2/MyApp2/app/controllers/static_pages_controller.rb

    def index
        @latest_courses = Course.order(created_at: :desc).limit(3)
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."created_at" DESC LIMIT $1  [["LIMIT", 3]]