assignment2/MyApp2/app/views/lessons/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."lesson_id" = $1  [["lesson_id", 4]]
---
        <div class="col">
        <% @lesson.questions.each do |question| %>

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 3]]
---
                    <h5>Respuestas:</h5>
                    <% question.answers.each do |answer| %>