assignment2/MyApp2/app/views/lessons/show.html.erb

        <div class="col">
        <% @lesson.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."lesson_id" = $1  [["lesson_id", 20]]

                    <h5>Answers:</h5>
                    <% question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 5]]